//
//  instModel.swift
//  VideoPlayScreen
//
//  Created by Nora Aldossary on 16/05/1445 AH.
//

import Foundation
import CloudKit


struct instCard: Identifiable {
    let id = UUID().uuidString
    let title: String
    let subTitle: String
    let imageName: String
    
    static let cardsS: [instCard] = [
        
        instCard(title: "دفوف", subTitle: "فالدف والرق هما آلتان من آلات الإيقاع الشرقي الرئيسية تعزف بطرق مختلفة ابتداء من الهز والخشخشة إلى الضرب بأصابع اليد بإيقاعات منتظمة.", imageName: "الدفوف"),
        
        instCard(title: "الربابة", subTitle: "آلة موسيقية استخدمها العرب قديماً، و تعود أصولها ما قبل الميلاد، و هي ذات وتر واحد", imageName: "صوره الربابه")
    ]
    
    static let cardsW: [instCard] = [
        instCard(title: "العود",subTitle: " العود هو آلة موسيقية تقليدية في الوطن العربي، وهي أحد أنواع العزف بواسطة الوتر", imageName: "صوره العود"),
        
        instCard(title: "السمسمية", subTitle: "الطنبورة أو الدربكة هي آلة إيقاعية تقليدية في الوطن العربي‎.بشكلها الدائريآلة حجازية. كان يُعزف عليها من قبل البدو والتجار والبحارة منذ القدم كأداة اجتماعية. ويطلق عليها السمسمية الحجازية والسمسمية البدوية", imageName: "2"),
        
        instCard(title: "المزمار", subTitle: "زمار هو آلة من الآلات الخشبية وآلات النفخ وهي من الآلات القديمة التي صنعها الإنسان من قصب الغاب، ويرجع تاريخ الآلة إلى القرن السابع عشر،وهو من العرب", imageName: "صوره المزمار")
    ]
    
    
    
    static let cardsE: [instCard] = [
        instCard(title: "العود",subTitle: " العود هو آلة موسيقية تقليدية في الوطن العربي، وهي أحد أنواع العزف بواسطة الوتر", imageName: "صوره العود"),
        
        instCard(title: "دفوف", subTitle: "فالدف والرق هما آلتان من آلات الإيقاع الشرقي الرئيسية تعزف بطرق مختلفة ابتداء من الهز والخشخشة إلى الضرب بأصابع اليد بإيقاعات منتظمة.", imageName: "الدفوف"),
        
        instCard(title: "المرواس", subTitle: "آلة ايقاعية صغيرة الحجم تتكون من اسطوانة خشبية مجوفة يشد عليها من الناحيتين قطعتين جلديتين تدعى الرقمة. ولقد اشتهر سكان الأحساء بالعزف عليها في مجالس السهر الطربي أو السمر الشعبية المعروفة بالفن السامري المشهور في منطقة نجد، حيث يعتمد على إيقاعات الدفوف والمرواس وهو من الشعر النبطي والفلكلورات القديمة في السعودية.", imageName: "صوره المرواس"),
    ]
    
    
    
    
    static let cardsN: [instCard] = [
        instCard(title: "دفوف", subTitle: "فالدف والرق هما آلتان من آلات الإيقاع الشرقي الرئيسية تعزف بطرق مختلفة ابتداء من الهز والخشخشة إلى الضرب بأصابع اليد بإيقاعات منتظمة.", imageName: "الدفوف"),
        
        instCard(title: "الطنبورة", subTitle: "الطنبورة أو الدربكة هي آلة إيقاعية تقليدية في الوطن العربي.بشكلها الدائري والمسطح، وتصنع عادةً من الخشب وتُغطى بجلد الحيوان على الجهتين.", imageName: "صوره الطنبور"),
        
        instCard(title: "المزمار", subTitle: "زمار هو آلة من الآلات الخشبية وآلات النفخ وهي من الآلات القديمة التي صنعها الإنسان من قصب الغاب، ويرجع تاريخ الآلة إلى القرن السابع عشر،وهو من العرب", imageName: "صوره المزمار")
    ]
    
    
    static let cardsC: [instCard] = [
        instCard(title: "العود",subTitle: " العود هو آلة موسيقية تقليدية في الوطن العربي، وهي أحد أنواع العزف بواسطة الوتر", imageName: "صوره العود"),
        
        
        instCard(title: "دفوف", subTitle: "فالدف والرق هما آلتان من آلات الإيقاع الشرقي الرئيسية تعزف بطرق مختلفة ابتداء من الهز والخشخشة إلى الضرب بأصابع اليد بإيقاعات منتظمة.", imageName: "الدفوف"),
        
        instCard(title: "المزمار", subTitle: "زمار هو آلة من الآلات الخشبية وآلات النفخ وهي من الآلات القديمة التي صنعها الإنسان من قصب الغاب، ويرجع تاريخ الآلة إلى القرن السابع عشر،وهو من العرب", imageName: "صوره المزمار")
    ]
    
    
    
    
    
    
    
}



